app/controllers/patients_controller.rb

INSERT INTO "patients" ("name", "phone", "address", "dateofbirth", "status", "medication", "emergencycontact", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @patient = Patient.new(patient_params)

    @patient.save