app/controllers/rectangles_controller.rb

SELECT "rectangles".* FROM "rectangles"
---
  def index
    @rectangles = Rectangle.all

SELECT  "rectangles".* FROM "rectangles" WHERE "rectangles"."id" = $1 LIMIT 1  [["id", 11]]
---
  def show
  @rectangle = Rectangle.find(params[:id])

SELECT  "rectangles".* FROM "rectangles" WHERE "rectangles"."id" = $1 LIMIT 1  [["id", 11]]
---
  def edit
    @rectangle = Rectangle.find(params[:id])

SELECT  "rectangles".* FROM "rectangles" WHERE "rectangles"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "rectangles" SET "color" = $1, "name" = $2, "images" = $3, "updated_at" = $4 WHERE "rectangles"."id" = $5  [["color", "Black"], ["name", "Alex Sweeten's"], ["images", "NoImage"], ["updated_at", "2016-09-18 01:42:46.693700"], ["id", 11]]
---
  def update
    @rectangle = Rectangle.find(params[:id])

  if @rectangle.update(rectangle_params)